"""
Реализовать класс Road ( дорога), в котором определить атрибуты: length (длина), width
(ширина). Значения данных атрибутов должны передаваться при создании экземпляра
класса. Атрибуты сделать защищенными. Определить метод расчета массы асфальта,
необходимого для покрытия всего дорожного полотна. Использовать формулу:
длина*ширина*масса асфальта для покрытия одного кв метра дороги асфальтом, толщиной в
1 см*число см толщины полотна. Проверить работу метода.
Например: 20м*5000м*25кг*5см = 12500 т
"""


class Road:
    ROAD_HEIGHT = 5  # в самтиметрах
    ROAD_DENSITY = 25  # в кг/м.кв. на 1см высоты

    def __init__(self, length, width):
        self._length = length
        self._width = width

    def mass(self):
        return self._length * self._width * Road.ROAD_HEIGHT * Road.ROAD_DENSITY

rr = Road(20, 5000)
print(f'Масса асфальта равна {rr.mass()} кг.')